{
  "opening" : "The unvierse is a wild, chaotic place.<br>Tyrannical empires, monstruous aliens, bloodthirst pirates, and the unforgiving vaccum make everything dangerous, makes every day uncertain.<br>Out of the chaos, forged in fire and blood, heroes arise.<br>You? You are one of them, and could very well be the greatest of them all; the true Defender of the Universe.<br>With a ship,a crew, your weapons and armor, and your own natural powers, you shall save panets, overthrow dictators, defeat horrific monsters, holdback the tide of evil, and bring peace and order to the universe.<br>You have <b>75 points.</b><br>Good luck, Hero.",
  "special" : {
    "opening" : "<b>What makes you special?</b><br>Choose One",
    "choices" : {
      "your_armor" : "<b>Your Armor</b><br>You stumbled upon an incredible suit of armor, one that is incredibly durable and has the firepower to rival and dreadnought. The suit seems to be powered by a strange, near-limitless cosmic energy.<br><br>-Power Armor is Free, Mech is 1/2 price<br>-All Restriction:Armor options are unlocked",
      "your_team" : "<b>Your Team</b><br>You and your crew are the biggest bad-asses in this super cluster. Each and every one of you are highly sought after by dozens of different governments, but you decided to band together and make a real difference.<br><br>-Your first two non-restricted Companions are Free<br>-All Restriction:Team options are unlocked",
      "your_ship" : "<b>Your Ship</b><br>Your ship truly is something else; no one you've ever brought it to has ever seen anything like it before. It's nigh-indestructible, faster than any other ship of its class, and it's inhabited by the most powerful A.I. ever found or made.<br><br>-All ship class costs are cut in half<br>-All Restriction:Team options are unlocked",
      "you" : "<b>You</b><br>You are a powerhouse, a living weapon, a one-person army. Nobody like you has ever existed before, you are a true outlier. What gives you this power, this cosmic might, is unknown.<br><br>-Peak Physical Fitness is Free<br>-All Restriction:You options are unlocked"
    }
  },
  "race" : {
    "opening" : "<b>Race</b><br>Choose One",
    "choices" : {
      "human" : {
        "lifespan" : 135,
        "lift_str" : 1100,
        "speed" : 30,
        "text" : "<b>Human</b><br>Bipedal pursuit hunter, skilled with tools.<br>Max Lifespan of 135 years.<br>Max Lifting Strength of 1100 lbs.<br>Max Speed of 30 mph.<br>Natural Environment is Varied; species is very adaptable and thrives in all climates except arid desert and frozen poles.<br><br>-Gain an extra 5 points.<br>-Gain Endurance for Free.",
        "free_skill" : "Endurance"
      },
      "android": {
        "lifespan": "Potentially Limitless",
        "lift_str": 1800,
        "speed": 40,
        "text": "<b>Android</b><br>Bipedal synthetic organism, skilled with tech.<br>All Androids are sapient, and can feel the same sensations that organics feel.<br>Do not age with frequent repair and upkeep.<br>Max Lifting Strength of 1800 lbs.<br>Max speed of 40 mph.<br>Natural Environment is Cold and Dry.<br><br>-Gain Tech Skills for Free.<br>-Gain Cybernetics (x4) for Free.",
        "free_skill": "Cybernetics"
      },
      "asari": {
        "lifespan": 950,
        "lift_str": 1000,
        "speed": 28,
        "text": "<b>Asari</b><br>Bipedal Mono-sexed psionics.<br>Max Lifespan of 900-1000 years.<br>Max Lifting Strength of 1000 lbs.<br>Max Speed of 28 mph.<br>Natural Environment is Tropical, but are almost as adaptable as humans.<br><br>-Gain Beautiful for Free.<br>-Gain Psionic for Free.<br>",
        "free_skill": {
          "0" : "Beautiful",
          "1" : "Psionics"
        }
      },
      "gray": {
        "lifespan": 210,
        "lift_str": 900,
        "speed": 27,
        "text": "<b>Gray</b><br>Bald, gray skinned humanoids with large brains.<br>Developed advanced anti-gravity tech.<br>Large height range in Males: 3-6 feet tall.<br>Females are taller: 6-7 feet.<br>Max Lifespan of 210 years.<br>Max Lifting Strength of 900 lbs.<br>Max Speed of 27 mph.<br>Natural Environment is Dry and Arid.<br><br>-Gain Intelligence for Free.",
        "free_skill": "Intelligence"
      },
      "aquoid": {
        "lifespan": 120,
        "lift_str": 1300,
        "speed": 35,
        "text": "<b>Aquoid</b><br>Bipedal aquatic humanoids, genetic engineers.<br>Possess two repository systems.<br>Max Lifespan of 120 years.<br>Max Lifting Strength of 1300 lbs.<br>Max Speed of 35 mph.<br>Natural Environment is Tropical waters.<br>Natural Depth is between 300 and 1000 feet.<br><br>-Gain Immune for Free.<br>-Gain Enhanced Senses for Free.",
        "free_skill": {
          "0" : "Immune",
          "1" : "Enhanced Senses"
        }
      },
      "qunari": {
        "lifespan": 150,
        "lift_str": 1600,
        "speed": 35,
        "text": "<b>Qunari</b><br>Bipedal metallic-skinned horned warriors.<br>Rigid, militaristic, hyper-socialist society.<br>Most clothes are traditional and revealing.<br>Average height of 6'10.<br>Max Lifespan of 150 years.<br>Max Lifting Strength of 1600 lbs.<br>Max Speed of 35 mph.<br>Natural Environments is Hot and Tropical.<br><br>-Gain Combat Training for Free",
        "free_skill": "Combat Training"
      }
    }
  },
  "abilities" : {
    "opening" : "<b>Abilities</b><br><You start off at 1/3 of your race's Max Strength",
    "choices" : {
      "beloved" : {
        "ability" : "Beloved",
        "points" : 2,
        "text" : "<b>Beloved (Cost: 2 Points)</b><br>You are naturally charismatic, and people naturally enjoy your pressence. Also, you're something of an intergalactic celebrity.<br>But you're more than just popular; you're inspiring. People are much more likely to help you or assist you.<br>Your team is more loyal to you now."
      },
      "psionics": {
        "ability": "Psionics",
        "points": 4,
        "text": "<b>Psionics (Cost: 4 Points)</b><br>You can telekinetically lift and move objects up to 3x your race's max lifting strength. You can also form a psychic link through physical contact, allowing you to share emotions and memories with a person, and you can generate psionic barriers that protect against attacks."
      },
      "combat_training": {
        "ability": "Combat Training",
        "points": 3,
        "text": "<b>Combat Training (Cost: 3 Points)</b><br>You have gone through the best your race has to offer in standard combat training.You know how to fire, clean, and maintain any firearm, drive any vehicle, and survive in prolonged combat.Also, your current strength is boosted to l/2 of your race's max strength, if it wasn't already."
      },
      "endurance": {
        "ability": "Endurance",
        "points": 2,
        "text": "<b>Endurance (Cost: 2 Points)</b><br> You have some of the best endurance in the galaxy.<br> You could jog for dozens of miles without a break, go days without sleep, food, or water, and you only need to sleep for about 4-5 hours a night."
      },
      "tech_skills": {
        "ability": "Tech Skills",
        "points": 2,
        "text": "<b>Tech Skills (Cost: 2 Points)</b><br> You are naturally skilled with electronics and technology.<br> You’re an expert hacker, you have advanced knowledge in and experience with engineering, and you’re far more skilled with energy weapons."
      },
      "cybernetics": {
        "ability": "Cybernetics",
        "points": 1,
        "text": "<b>Cybernetics (Cost: 1 Point)</b><br> One of your limbs has been replaced with a cybernetic prosthetic.<br> This cybernetic limb can exert twice as much force as a standard limb. However, these limbs need to be repaired regularly, and unless you upgrade, you can’t get stronger. This can be taken up to 4 times."
      },
      "enhanced_senses": {
        "ability": "Enhanced Senses",
        "points": 2,
        "text": "<b>Enhanced Senses (Cost: 2 Points)</b><br> With genetic and/or cybernetic engineering, your senses have been boosted.You can now see in the dark, your vision can pick out details from dozens of meters away, and you could hear a pin drop in a crowded room."
      },
      "intelligence": {
        "ability": "Intelligence",
        "points": 3,
        "text": "<b>Intelligence (Cost: 3 Points)</b><br> You are a natural genius. In human terms, you have an I.Q. of around 150, and you have a photographic memory.<br> You are also naturally inventive, and you have a natural talent for theoretical physics and advanced mathematics."
      },
      "beautiful": {
        "ability": "Beautiful",
        "points": 2,
        "text": "<b>Beautiful (Cost: 2 Points)</b><br> Your physical appearance turns heads everywhere you go.<br> Even people who aren't your own species are usually attracted to you.<br> For Androids; you look and feel far more lifelike.You could even have some of the right..‘parts’ installed."
      },
      "special_ops": {
        "ability": "Special Ops",
        "points": 4,
        "text": "<b>Special Ops (Cost: 4 Points)<br> Requires Combat Training</b><br> You are one of the elite.<br> You have been heavily trained in unconventional warfare.<br> You are a master of sabotage, assassination, espionage, and you excel in high-risk combat situations."
      },
      "peak_physical_fitness": {
        "ability": "Peak Physical Fitness",
        "points": 4,
        "text": "<b>Peak Physical Fitness (Cost: 4 Points)</b><br> Your lifting strength, speed, and lifespan are boosted to that of your race’s maximum.<br> You are the best your species has to offer."
      },
      "immune": {
        "ability": "Immune",
        "points": 2,
        "text": "<b>Immune (Cost: 2 Points)</b><br> Thanks to genetic engineering, you heal 30% faster than normal people, and your immune system is much tougher.<br> You also have no genetic or birth defects.<br> Cannot be taken by androids."
      },
      "medical_expert": {
        "ability": "Medical Expert",
        "points": 3,
        "text": "<b>Medical Expert (Cost: 3 Points)</b><br> You have a doctorate in a medical field of your choice from a prestigious university.<br> You know how to perform first aid and use advanced medical technology."
      },
      "piloting": {
        "ability": "Piloting",
        "points": 2,
        "text": "<b>Piloting (Cost: 2 Points)</b><br> You graduated with top marks from your race’s best piloting academy.<br> You are an expert pilot with every manner of spacecraft"
      },
      "diplomatic": {
        "ability": "Diplomatic",
        "points": 2,
        "text": "<b>Diplomatie (Cost: 2 Points)</b><br> You are an expert negotiator.<br> You could talk your way out of or through a hostage situation, a kidnapping, or a business deal.<br> You could be an amazing politician, and perhaps you were at one point."
      },
      "hidden_weapon": {
        "ability": "Hidden Weapon",
        "points": 2,
        "text": "<b>Hidden Weapons (Cost: 2 Points)<br> Requires Cybernetics</b><br> For each cybernetic limb you have, you can hide one of the following retractable weapons in it:<br> a pistol<br> a hyper-durable blade<br> a short-range flamethrower<br> a buzz saw"
      },
      "psionic_enhancement": {
        "ability": "Psionic Enhancement",
        "points": 2,
        "text": "<b>Psionic Enhancement (Cost: 2 Points)<br> (Requires: Psionics)</b><br> Your psionics can now boost your running speed by 10 mph, you can jump twice as far and high, and you can use psionics to temporarily boost your healing by up to 50%."
      },
      "elementalism": {
        "ability": "Elementalism",
        "points": 1,
        "text": "<b>Elementalism (Cost: 1 Point)</b><br> Through either tech or psionics, you can heat up or cool down objects through touch, generate small to medium sized flames, create balls of ice, and generate the same amount of electricity as a taser."
      },
      "precision": {
        "ability": "Precision",
        "points": 2,
        "text": "<b>Precision (Cost: 2 Points)</b><br> Both you and your hands are always steady and precise.This makes you a far better shot, and it’s easier to perform surgery or sautering.<br> With Psionics, you can carefully move delicate objects, unlock doors, and even snap bones from a distance."
      },
      "rage": {
        "ability": "Rage",
        "points": 3,
        "text": "<b>Rage (Cost: 3 Points)</b><br> Through sheer determination and unbridled rage, you can ignore pain, you are harder to knock unconscious, and you absolutely refuse to die. If someone buried you alive, you would force yourself to dig your way out, no matter how deep down you are."
      },
      "super_soldier": {
        "ability": "Super Soldier",
        "points": 6,
        "text": "<b>Super Soldier (Restriction:You) (Cost: 6 Points)</b><br> You can now lift over 5x your races max lifting strength, run at over 55 mph, and you heal 2x faster than normal.You are also now an expert marksman, your skin is tougher, and your reflexes are faster. If you lose a limb, a tooth, or an organ, it will slowly regrow and repair."
      },
      "superhuman": {
        "ability": "Superhuman",
        "points": 6,
        "text": "<b>Superhuman (Restriction:You) (Cost: 6 Points)</b><br> Requires Psionics Your psionic powers are now so intense that you can lift up to 25 tons with them.<br> You can generate barriers so large they encompass ships, crush normal people into paste, and you can even fly using your telekinesis."
      },
      "armored": {
        "ability": "Armored",
        "points": 6,
        "text": "<b>Armored (Restriction:You) (Cost: 6 Points)</b><br> Most of your chest and head have been replaced with unique, alien cybernetics, and nanobots flow through your blood. All of your mechanical parts automatically and rapidly repair, and your healing is boosted to 5x faster than normal.<br> All of your cybernetics are now tough enough to stop bullets."
      },
      "synergy": {
        "ability": "Synergy",
        "points": 5,
        "text": "<b>Synergy (Restriction:Team) (Cost: 5 Points)</b><br> You and your teammates somehow have an unconscious psychic link; you all seem to know where the others are, even across light years.<br> You also sync up unbelievably well; you all can come up with and follow unspoken plans on the fly. Your team is unspeakably loyal to you, and you can sense each other’s injures."
      }
    }
  },
  "armor" : {
    "opening" : "<b>Armor</b><br>You can choose EITHER the Mech or the PA",
    "choices" : {
      "space_suit": {
        "type": "Space Suit",
        "points": 0,
        "traits": 4,
        "ext_str": 0,
        "use_time": 0,
        "text": "<b>Space Suit (Cost: Free)</b><br> Kevlar suit with ceramic armor, has mag boots.<br> Light and fast, no strength boost.<br> Has a magnetic clamp on each arm and leg, and two on the back, which connect to your weapons.<br> Has communication systems in the helmet.<br> Can fit 4 traits.<br> You can have the Space Suit and one other suit.<br> For Androids; incorporate all of your Space Suit traits into your body."
      },
      "powered_armor": {
        "type": "Powered Armor",
        "points": 4,
        "traits": 8,
        "ext_str": 1000,
        "use_time": 6,
        "text": "<b>Powered Armor (Cost: 4 Points)</b><br> Heavy suit, titanium-based alloy, vacuum-sealed.<br> 5 inches taller than you.<br> Allows you to carry 1,000 lbs more than you previously could.<br> Needs to be recharged after 6 hours of use.<br> Has magnetic clamps for large weapons and internal compartments for small weapons.<br> Can fit 8 traits."
      },
      "mech_suit": {
        "type": "Mech Suit",
        "points": 8,
        "traits": 12,
        "ext_str": 10000,
        "use_time": 3,
        "text": "<b>Mech Suit (Cost: 8 Points)</b><br> 11 ft tall armored suit.<br> Slow, big, and durable.<br> Allows you to carry up to 10,000 lbs.<br> Needs to be recharged after 3 hours of use.<br> Has internal compartments for weapons. <br>Can fit 12 traits."
      }
    }
  },
  "armor_traits" : {
    "opening" : "<b>Armor Traits</b>",
    "choices" : {
      "nanobots": {
        "trait": "Nanobots",
        "points": 1,
        "text": "<b>Nanobots (Cost: 1 Point)</b><br> Your armor repairs itself slowly thanks to a cluster of nanobots that are released when the armor is damaged."
      },
      "survivalist": {
        "trait": "Survivalist",
        "points": 1,
        "text": "<b>Survivalist (Cost: 1 Point)</b><br> Your armor houses dozens of small, retractable tools, including a knife, a blowtorch, a flare gun, a taser, various wrenches, screwdrivers, pliers, scissors, and more.<br> Your helmet also has night-vision and thermal imaging."
      },
      "dr_armor": {
        "trait": "Dr.Armor",
        "points": 1,
        "text": "<b>Dr. Armor (Cost: 1 Point)</b><br> Your suit's medical suite carries healing gel, your armor can lock up limbs when it detects broken bones, it dispenses adrenaline and electric shocks when it detects heart failure, it can administer local anesthetics, and if you have an A.I, this suite is controlled by it."
      },
      "collapsible": {
        "trait": "Collapsible",
        "points": 1,
        "text": "<b>Collapsible (Cost: 1 Point)</b><br> Your suit can easily snap together, and each piece can be collapsed into a small, light frame, and parts of your suit can be rolled back easily.<br> Your suit is much easier to hide and carry. For Mechs, this allows your suit to get much smaller for transport."
      },
      "enhanced_servos": {
        "trait": "Enhanced Servos",
        "points": 2,
        "text": "<b>Enhanced Servos (Cost: 2 Points)</b><br> Powerful servos in your arms and legs boosts your strength in suit.<br> For Space Suit, you can carry 400 lbs more.<br> For Powered Armor, you can carry 800 lbs more.<br> For Mech, you can carry 1,400 lbs more."
      },
      "enhanced_shell": {
        "trait": "Enhanced Shell",
        "points": 2,
        "text": "<b>Enhanced Shell (Cost: 2 Points)</b><br> Your suit's armor is replaced with a stronger, more durable substance, while also maintaining the same weight"
      },
      "enhanced_size": {
        "trait": "Enhanced Size",
        "points": 2,
        "text": "<b>Enhanced Size (Cost: 2 Points)<br> Mech Only</b><br> Your suit is much bigger;<br> now your Mech is 50 feet tall, and can carry 3x as much as before."
      },
      "energy_systems": {
        "trait": "Energy Systems",
        "points": 1,
        "text": "<b>Energy Systems (Cost: 1 Point)</b><br> Your suit is now run by a powerful, clean, efficient energy source.<br> Power Armor and Mech have miniaturized reactors on them now.<br> You could stay in your suit for hours, even days on end, and your suit is hardened against EMPs."
      },
      "elemental_gauntlets": {
        "trait": "Elemental Gauntlets",
        "points": 1,
        "text": "<b>Elemental Gauntlets (Cost: 1 Point)</b><br> Your gauntlets can fire streams, blasts, and Jets of fire, ice, and electricity."
      },
      "kinetic_gauntlets": {
        "trait": "Kinetic Gauntlets",
        "points": 1,
        "text": "<b>Kinetic Gauntlets (Cost: 1 Point)</b><br> Your gauntlets can fire blasts of kinetic force, allowing you to send shockwaves through the air or ground, knocking enemies back and off their feet.<br> This also significantly enhances your punches."
      },
      "energy_gauntlets": {
        "trait": "Energy Gauntlets",
        "points": 2,
        "text": "<b>Energy Gauntlets (Cost: 2 Points)</b><br> You can fire blasts of energy from the palms of your hands.<br> These blasts carry heat, and can knock an armored human off their feet.This is effective against armored opponents, as the blasts cut through armor."
      },
      "firepower": {
        "trait": "Firepower",
        "points": 2,
        "text": "<b>Firepower (Cost: 2 Points)</b><br> For Space Suits, you have a hidden machine gun in each gauntlet.<br> For PAs, you have the above and hidden missile launchers in your shoulder plates.<br> For Mechs, you have the above and a mounted minigun that slides out of your left: shoulder."
      },
      "kinetic_shield": {
        "trait": "Kinetic Shield",
        "points": 1,
        "text": "<b>Kinetic Shield (Cost: 1 Point)</b><br> These shields automatically deflect any object with sufficient speed.<br> It will activate to deflect anything from crossbow bolts to bullets.<br> It does not block energy blasts, lasers, or immense heat, although energy weapons are rare, and are typically restricted for military use."
      },
      "energy_shield": {
        "trait": "Energy Shield",
        "points": 2,
        "text": "<b>Energy Shield (Cost: 2 Points)</b><br> These shields are stronger than kinetic shields, but take up more power.<br> They block both kinetic and energy weapons, and have some effect against immense heat and radiation."
      },
      "hardlight_shield": {
        "trait": "Hardlight Shield",
        "points": 1,
        "text": "<b>Hardlight Shield (Cost: 1 Point)</b><br> These close-range shields will activate if anyone gets too close.<br> They are decent against guns, but are more suited towards close quarter combat as they hold closer to the body and block both punches and melee attacks."
      },
      "smart_armor": {
        "trait": "Smart Armor",
        "points": 2,
        "text": "<b>Smart Armor (Cost: 2 Points)</b><br> Insulated, heat-resistant armor plating that detects incoming strikes and locks up and hardens to absorb the impact"
      },
      "tentacle": {
        "trait": "Tentacle",
        "points": 2,
        "text": "<b>Tentacle (Cost: 2 Points)</b><br> Your suit houses a single, retractable metal tentacle that can extend from your back up to 4 feet, and can be used as an extra limb, a weapon, or can be used with your hacking.<br> Mechs can extend up to 10 feet, and have two tentacles."
      },
      "jump_jets": {
        "trait": "Jump Jets",
        "points": 2,
        "text": "<b>Jump Jets (Cost: 2 Points)</b><br> You can launch yourself up to 30 feet forward and into the air thanks to these jets on your boots and back.You can also use these to move around in zero-G.<br> The distance is doubled for powered armors, and tripled for mechs."
      },
      "stealth": {
        "trait": "Stealth",
        "points": 2,
        "text": "<b>Stealth (Cost: 2 Points)</b><br> Your suit muffles your footsteps and noises you make. It also comes with a built-in cloaking field that turns you invisible for a brief time.<br> This works on cameras, but you can still be picked up by motion detectors unless you have a cyberwarfare suite."
      },
      "cyberwarfare_suite": {
        "trait": "Cyberwarfare Suite",
        "points": 1,
        "text": "<b>Cyberwarfare Suite (Cost: 1 Point)</b><br> Your suit has hacking systems that can be used to get through locked doors, disable security cameras and drones, and make armors malfunction.Your A.I. will control this suite if you have one."
      },
      "super_suit": {
        "trait": "Super Suit",
        "points": 6,
        "text": "<b>Super Suit (Cost: 6 Points)<br> (Restriction: Armor)<br> PA or Mech only</b><br> Your strength in armor is boosted to the point where you could lift a frigate by yourself, and your built-in weapons are now strong enough to rival battleships. Your suit is also built out of hypermatter, making it extremely durable and it repairs itself over time."
      },
      "advanced_flight": {
        "trait": "Advanced Flight",
        "points": 6,
        "text": "<b>Advanced Flight (Cost: 6 Points)<br> (Restriction: Armor)<br> Requires Jump Jets<br> PA or Mech only</b><br> Your armor can fly under its own power for days, and it can fly faster than any spaceship, as well as being capable of FTL jumps.<br> Your suit is durable enough to withstand and protect you from these speeds, as well as extreme heat."
      },
      "psychic_link": {
        "trait": "Psychic Link",
        "points": 6,
        "text": "<b>Psychic Link (Cost: 6 Points)<br> (Restriction: Armor)<br> PA or Mech only</b><br> You can remotely, psychically connect to your armor, even across light years, and command it to come to you, wherever you are.<br> You also can activate your suit’s functions with just a thought, and your suit is now unhackable."
      },
      "amplifier": {
        "trait": "Amplifier",
        "points": 5,
        "text": "<b>Amplifier (Restriction:You)<br> (Costs: 5 Points)<br> Requires Psionics</b><br> Your suit now syncs up to your body, amplifying your psionic abilities.<br> Now, when you are in your suit you can lift and throw twice as much with your psionics, and your barriers can withstand ship-grade weaponry."
      }
    }
  },
  "weapons" : {
    "opening" : "<b>Weapons</b>",
    "choices" : {
      "hardlight_blade": {
        "name": "Hardlight Blade",
        "points": 1,
        "text": "<b>Hardlight Blade (Cost: 1 Point)</b><br> A blade of hardlight that you can project from your suit.<br> This blade is superheated, and can carve through bodies easily."
      },
      "phaser": {
        "name": "Phaser",
        "points": 1,
        "text": "<b>Phaser (Cost: 1 Point)</b><br> A rechargeable energy weapon that interacts with its targets nervous system, and can be set to stun, knock out or kill."
      },
      "pulse_rifle": {
        "name": "Pulse Rifle",
        "points": 1,
        "text": "<b>Puise Rifle (Cost: 1 Point)</b> This assault rifle fires tiny balls of energy at an extremely fast rate, this gives it low accuracy and moderate kickback.<br> Very good against shields."
      },
      "heavy_flamethrower": {
        "name": "Heavy Flamethrower",
        "points": 1,
        "text": "<b>Heavy Flamethrower (Cost: 1 Point)</b><br> This flamethrower generates a powerful jet of plasma, incinerating everything within a 12 foot cone of the nozzle."
      },
      "kinetic_staff": {
        "name": "Kinetic Staff",
        "points": 2,
        "text": "<b>Kinetic Staff (Cost: 2 Points)</b><br> This staff, when the end is slammed into a person or a surface, generates a blast of kinetic energy that sends people flying back."
      },
      "pulse_pistols": {
        "name": "Pulse Pistols",
        "points": 2,
        "text": "<b>Pulse Pistols (Cost: 2 Points)</b><br> These pistols fire tiny balls of energy at an extremely fast rate.<br> Thus, these pistols have low accuracy but minimal kickback.<br> Very good against shields."
      },
      "mag": {
        "name": "MAG",
        "points": 2,
        "text": "<b>MAG (Cost: 2 Points)</b><br> This assault rifle uses magnets to accelerate bullets like a rail gun.<br> Has more kickback than most assault rifles, and hard to aim without a lot of strength, but hits like a sniper rifle."
      },
      "heavy_cryo_cannon": {
        "name": "Heavy Cryo Cannon",
        "points": 2,
        "text": "<b>Heavy Cryo Cannon (Cost: 2 Points)</b><br> Fires balls of super-cooled goo that sticks to and instantly freezes onto any surface it hits.<br> Can cause hypothermia, frostbite, and death."
      },
      "mono_molecular_blade": {
        "name": "Mono-molecular Blade",
        "points": 2,
        "text": "<b>Mono-molecular Blade (Cost: 2 Points)</b><br> This hyper-thin blade is only a molecule thick, allowing it to cut through most armors with ease."
      },
      "tiger_sharks": {
        "name": "Tiger Sharks",
        "points": 2,
        "text": "<b>Tiger Sharks (Cost: 2 Points)</b><br> Collapsible, easy to conceal energy pistols.<br> Balances firing speed and impact power.<br> Good accuracy, low recoil."
      },
      "falcon_sniper_rifle": {
        "name": "Falcon Sniper Rifle",
        "points": 2,
        "text": "<b>Falcon Sniper Rifle (Cost: 2 Points)</b><br> Collapsible and easy to carry sniper rifle.<br> Uses mass alteration fields to fire a tiny shred of metal at a small fraction of the speed of light"
      },
      "pulse_grenade_launcher": {
        "name": "Pulse Grenade Launcher",
        "points": 2,
        "text": "<b>Pulse Grenade Launcher (Cost: 2 Points)</b><br> Fires mini-pulse grenades that explode in a fireball of plasma."
      },
      "plasma_blade": {
        "name": "Plasma Blade",
        "points": 3,
        "text": "<b>Plasma Blade (Cost: 3 Points)</b><br> This powerful energy weapon is easy to conceal, as it is just a handle until it is activated.<br> The 3-foot long plasma blades cut through bodies, armor, and shields with relative ease."
      },
      "magnum": {
        "name": "Magnum",
        "points": 3,
        "text": "<b>Magnum (Cost: 3 Points)</b><br> Slow-firing pistol, fires a powerful blast of energy every 2 seconds."
      },
      "puma_energy_rifle": {
        "name": "PUMA Energy Rifle",
        "points": 3,
        "text": "<b>PUMA Energy Rifle (Cost: 3 Points)</b><br> Long range energy rifle.<br> Fires bolts of plasma faster than a sniper, but is slower and more powerful than an assault rifle."
      },
      "large_pulse_laser": {
        "name": "Large Pulse Laser",
        "points": 3,
        "text": "<b>Large Pulse Laser (Cost: 3 Points)</b><br> Heavy single-barreled laser cannon.<br> Very hard to aim. but chews through armor like paper.<br> Can be mounted onto a suit of Powered Armor by sliding it over one of the hands."
      },
      "uber_blade": {
        "name": "Uber Blade",
        "points": 3,
        "text": "<b>Über Blade (Cost: 3 Points)</b><br> This blade is not only incredibly durable and extremely sharp, but a generator in the hilt causes the blade to vibrate at high frequencies, so when it hits a person, it tears right through them."
      },
      "the_panther": {
        "name": "The Panther",
        "points": 3,
        "text": "<b>The Panther (Cost: 3 Points)</b><br> A long-range, high-powered energy pistol.<br> This pistol fires very quietly, making it great for stealth."
      },
      "particle_beam_rifle": {
        "name": "Particle Beam Rifle",
        "points": 3,
        "text": "<b>Particle Beam Rifle (Cost: 3 Points)</b><br> This rifle fires a beam of energy that can hold steady for up to 8 seconds.<br> It does immense damage against both shields and armor."
      },
      "heavy_minigun": {
        "name": "Heavy Minigun",
        "points": 3,
        "text": "<b>Heavy Minigun (Cost: 3 Points)</b><br> Much lighter and sleeker than the miniguns of old, but still weighs a couple dozen pounds.<br> Chews through people."
      }
    }
  },
  "ship" : {
    "opening" : "<b>Ship</b><br>Pick one size",
    "choices" : {
      "frigate": {
        "type": "Frigate",
        "length": 200,
        "decks": 5,
        "traits": 6,
        "main_weapons": 1,
        "points": 4,
        "text": "<b>Frigate (Cost: 4 Points)</b><br> Fast and Light, meant more for stealth, scouting, extraction, search-and-rescue, etc.<br> Between 100 and 200 meters long.<br> Typically has 3-5 decks.<br> Can fit 6 traits and 1 main weapon."
      },
      "cruiser": {
        "type": "Cruiser",
        "length": 500,
        "decks": 8,
        "traits": 8,
        "main_weapons": 1,
        "points": 6,
        "text": "<b>Cruiser (Cost: 6 Points)</b><br> Larger than a frigate, very popular as it balances armor with speed.<br> Between 300 and 500 meters long.<br> Typically has 5-8 decks.<br> Can fit 8 traits and 1 main weapon."
      },
      "battleship": {
        "type": "Battleship",
        "length": 900,
        "decks": 12,
        "traits": 10,
        "main_weapons": 1,
        "points": 8,
        "text": "<b>Battleship (Cost: 8 Points)</b><br> 3/4ths the size of a dreadnought very large and very heavily armed, but still pretty slow and doesn’t have as much armor as the dreadnought.<br> Between 700 and 900 meters long.<br> Typically has 8-12 decks.<br> Can fit 10 traits and 1 main weapon."
      },
      "dreadnought": {
        "type": "Dreadnought",
        "length": 1800,
        "decks": 18,
        "traits": 12,
        "main_weapons": 2,
        "points": 10,
        "text": "<b>Dreadnought (Cost: 10 Points)</b><br> Biggest ship, other than Gray motherships. Slower than battleships, can’t land on most planets.<br> Immense armor and weaponry.<br> 900+ meters, typical limit is 1800 meters.<br> Can fit 12 traits and 2 main weapons."
      }
    }
  },
  "ship_style" : {
    "opening" : "<b>Style</b><br>Choose one, your race's style is Free",
    "choices" : {
      "human": {
        "type": "Human",
        "points": 2,
        "free_traits": {
          "0": "Kinetic Shields",
          "1": "Rail Guns"
        },
        "speed": 20,
        "text": "<b>Human (Cost: 2 Points)</b><br> Blocky and gray, typically very militaristic.<br> Uses Kinetic Shields and Rail Guns (are Free).<br> Typical FTL speed is 18-20 LY per Day."
      },
      "android": {
        "type": "Android",
        "points": 2,
        "free_traits": {
          "0": "Kinetic Shields",
          "1": "Particle Beams"
        },
        "speed": 21,
        "text": "<b>Android (Cost: 2 Points)</b><br> Very utilitarian, focuses on function.<br> Uses Kinetic Shields and Particle Beams (are Free).<br> Typically employs swarms of unmanned fighters.<br> Typical FTL speed is 18-21 LY per day."
      },
      "asari": {
        "type": "Asari",
        "points": 2,
        "free_traits": {
          "0": "Energy Shields",
          "1": "Mass Accelerators"
        },
        "speed": 22,
        "text": "<b>Asari (Cost: 2 Points)</b><br> Sleek, rounded, and lots of glowing lights.<br> Uses Energy Shields and Mass Accelerators (are Free).<br> Typical FTL speed is 18-22 LY per day."
      },
      "gray": {
        "type": "Gray",
        "points": 4,
        "free_traits": {
          "0": "Energy Shields",
          "1": "Particle Beams"
        },
        "speed": 24,
        "text": "<b>Gray (Cost: 4 Points)</b><br> Disc shaped and intricate.<br> Uses Energy Shields and Particle Beams (are Free).<br> Has Gravity tech that allows for dreadnoughts to land on planets, and for tractor beams.<br> Typical FTL speed is 20-24 LY per day."
      },
      "aquoid": {
        "type": "Aquoid",
        "points": 2,
        "free_traits": {
          "0": "Kinetic Shields",
          "1": "Mass Accelerators"
        },
        "speed": 20,
        "text": "<b>Aquoid (Cost: 2 Points)</b><br> Very organic and sea-animal shaped.<br> Built for deep oceans and deep space.<br> Uses Kinetic Shields and Mass Accelerators (are Free).<br> Typical FTL speed is 17-20 LY per Day."
      },
      "qunari": {
        "type": "Qunari",
        "points": 2,
        "free_traits": {
          "0": "Energy Shields",
          "1": "Casaba Howitzers"
        },
        "speed": 22,
        "text": "<b>Qunari (Cost: 2 Points)</b><br> Long, angular, and sturdy.<br> Uses Energy Shields and Casaba Howitzers (are Free).<br> Typical FTL speed is 17-22 LY per day."
      }
    }
  },
  "ship_traits" : {
    "opening" : "<b>Ship Traits</b><br>Only once you spend points on an option, it becomes a Trait.",
    "choices" : {
      "medical_bay": {
        "trait": "Medical Bay",
        "points": 2,
        "text": ""
      },
      "mess_hall": {
        "trait": "Mess Hall",
        "points": 1,
        "text": ""
      },
      "crew_quarters": {
        "trait": "Crew Quarters",
        "points": 1,
        "text": ""
      },
      "recreational_rooms": {
        "trait": "Recreational Rooms",
        "points": 2,
        "text": ""
      },
      "shields": {
        "trait": "shields",
        "type" : {
          "1" : "Energy",
          "2" : "Kinetic"
        },
        "points": 1,
        "upgrade" : 2,
        "text": ""
      },
      "hull": {
        "trait": "Hull",
        "points": 2,
        "text": ""
      },
      "defenses": {
        "trait": "Defenses",
        "type" : {
          "1" : "Rail",
          "2" : "Mass",
          "3" : "Energy",
          "4" : "Laser"
        },
        "points": 2,
        "text": ""
      },
      "security": {
        "trait": "Security",
        "tpd" : 2,
        "points": 1,
        "upgrade": 2,
        "text": ""
      },
      "crew": {
        "trait": "Crew",
        "points": 1,
        "text": ""
      },
      "engines": {
        "trait": "Engines",
        "points": 2,
        "text": ""
      },
      "hangar_bay": {
        "trait": "Hangar Bay",
        "points": 1,
        "upgrade" : 1,
        "text": ""
      },
      "training": {
        "trait": "Training",
        "points": 1,
        "text": ""
      },
      "particle_beam_cannon": {
        "trait": "Particle Beam Cannon",
        "points": 1,
        "weapon" : true,
        "text": ""
      },
      "rail_gun": {
        "trait": "Rail Gun",
        "points": 1,
        "weapon" : true,
        "text": ""
      },
      "mass_accelerator_cannon": {
        "trait": "Mass Accelerator Cannon",
        "points": 1,
        "weapon":true,
        "text": ""
      },
      "casaba_howitzer": {
        "trait": "Casaba Howitzer",
        "points": 1,
        "weapon":true,
        "text": ""
      },
      "armory": {
        "trait": "Armory",
        "points": 1,
        "upgrade":1,
        "text": ""
      },
      "stealth": {
        "trait": "Stealth",
        "points": 1,
        "upgrade":2,
        "text": ""
      },
      "life_support": {
        "trait": "Life Support",
        "points": 1,
        "text": ""
      },
      "observation_decks": {
        "trait": "Observation Decks",
        "points": 1,
        "upgrade": 1,
        "text": ""
      },
      "dropships": {
        "req" : "Hangar Bay",
        "trait": "Dropships",
        "points": 1,
        "text": ""
      },
      "fighter": {
        "req" : "Hangar Bay",
        "trait": "Fighter",
        "points": 1,
        "text": ""
      },
      "apcs": {
        "trait": "APCs",
        "req" : "Hangar Bay",
        "points": 1,
        "text": ""
      },
      "hover_tanks": {
        "trait": "Hover Tanks",
        "req" : "Hangar Bay",
        "points": 2,
        "text": ""
      },
      "ai": {
        "trait": "AI",
        "points": 1,
        "text": ""
      },
      "cyberwarfare_suite": {
        "trait": "cyberwarfare_suite",
        "points": 1,
        "text": ""
      },
      "drones": {
        "trait": "Drones",
        "points": 1,
        "text": ""
      },
      "command_bridge": {
        "trait": "command_bridge",
        "points": 0,
        "text": ""
      },
      "built_to_last": {
        "trait": "Built to Last",
        "points": 1,
        "text": ""
      },
      "skeleton_crew": {
        "trait": "Skeleton Crew",
        "extr_crew" : "1",
        "points": 1,
        "text": ""
      },
      "luxury": {
        "trait": "Luxury",
        "points": 1,
        "text": ""
      },
      "grav_tech": {
        "trait": "Grav-Tech",
        "points": 2,
        "text": ""
      },
      "atmospheres": {
        "trait": "Atmospheres",
        "points": 1,
        "text": ""
      },
      "efficiency": {
        "trait": "Efficiency",
        "points": 1,
        "text": ""
      },
      "hypernought": {
        "trait": "Hypernought",
        "points": 6,
        "text": ""
      },
      "superluminal": {
        "trait": "Superluminal",
        "points": 6,
        "text": ""
      },
      "superweapon": {
        "trait": "Superweapon",
        "extr_weapons" : 2,
        "points": 6,
        "text": ""
      },
      "deus_ex_machina": {
        "trait": "Deus Ex Machina",
        "points": 5,
        "text": ""
      }
    }
  }
}